package chapter2.task4;

/*Почему в Java нельзя реализовать метод, меняющий местами содержимое двух
переменных типа int ?
Вместо этого напишите метод, меняющий местами содержимое двух объектов типа IntHolder.
(Описание этого малоизвестного класса можно найти в документации на прикладной программный интерфейс Java API.)
 Можно ли поменять местами содержимое двух объектов типа Integer?
*/

public class TaskFour {

    /* Потому что находятся в одном фрагменте памяти*/
    public static void main(String[] args) {

    }
}
