package chapter2.task14;

/*Скомпилируйте класс Network, представленный в этой главе. Обратите внимание на то, что файл внутреннего класса называется Network$Member.class.
 Воспользуйтесь утилитой javap, чтобы исследовать сгенерированный код. Так, по следующей команде:
javap -private имяКласса
выводятся методы и переменные экземпляра.
Выявите среди выводимых результатов ссылку на объемлющий класс.
 (В Linux и Mac OS X перед знаком $ в имени класса следует указать знак \ при выполнении утилиты javap.)*/


public class Task14 {
}
