package chapter2.task9;

/*Реализуйте класс Саг, моделирующий передвижение автомобиля на бензиновом топливе по оси х.
Предоставьте методы для передвижения автомобиля на заданное количество километров,
заполнения топливного бака заданным количеством литров бензина, вычисления расстояния, пройденного от начала
координат, а также уровня топлива в баке.


Укажите расход топлива (в км/л) в качестве параметра конструктора данного класса.

Должен ли этот класс быть неизменяемым и почему?*/
/*Нет, не должен быть изменяемым*/

public class TaskNine {

    private double petrol;
    private double distance;



    public static void main(String[] args) {

    }
}
